import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-box-feature',
  templateUrl: './box-feature.component.html',
  styleUrls: ['./box-feature.component.css']
})
export class BoxFeatureComponent implements OnInit {

  boxFeatureOne:any;
  boxFeatureTwo:any;
  changeHover:boolean;
  
  constructor() { 
    this.boxFeatureOne = [true,true,true];
    this.boxFeatureTwo = [true,true,true];
  }

  iconsFeature = [
    [
      { classIcon: 'lni-book', title:'مستندات کامل', text:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. ' },
      { classIcon: 'lni-leaf', title:'طراحی تمیز و مدرن', text:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. ' },
      { classIcon: 'lni-map', title:'ویژگی های بزرگ', text:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. ' }
      
  ],
  [
    { classIcon: 'lni-cog', title:'طرح عالی', text:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. ' },
    { classIcon: 'lni-pointer-up', title:'کاربر پسند', text:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. ' },
    { classIcon: 'lni-layout', title:'با قابلیت شخصی سازی', text:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. ' }
  ]
]
  ngOnInit() {
  }

}
